Repository: CofficLab/Lumi
Catalog: LumiApp/Plugins-Agent/AgentFilePreviewPlugin/AgentFilePreview.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: Are you sure you want to close this preview?
zh_hans: 确定要关闭此预览吗？
zh_hk: 確定要關閉此預覽嗎？

source: File Preview
zh_hans: 文件预览
zh_hk: 文件預覽

source: Dark Themes
zh_hans: 深色主题
zh_hk: 深色主題

source: Light Themes
zh_hans: 浅色主题
zh_hk: 淺色主題

# Large File Read-Only Preview
source: Large file uses read-only preview mode for performance.
zh_hans: 大文件已切换为只读预览模式以保证性能。
zh_hk: 大型文件已切換為只讀預覽模式以確保效能。

source: Other Themes
zh_hans: 其他主题
zh_hk: 其他主題

# Preview Truncated for Large File
source: File is very large, only a partial preview is shown.
zh_hans: 文件过大，仅显示部分预览内容。
zh_hk: 文件過大，僅顯示部分預覽內容。

source: Preview Not Supported
zh_hans: 不支持预览
zh_hk: 不支援預覽

# Preview Not Supported Type
source: This file type is not supported for preview
zh_hans: 当前文件类型不支持预览
zh_hk: 當前文件類型不支援預覽

source: File too large. Preview is truncated.
zh_hans: 文件过大，预览内容已截断。
zh_hk: 文件過大，預覽內容已截斷。

source: Save
zh_hans: 保存
zh_hk: 儲存

source: Save Failed
zh_hans: 保存失败
zh_hk: 儲存失敗

source: Select File to Preview
zh_hans: 选择文件进行预览
zh_hk: 選擇文件進行預覽

# 文件预览
source: File Preview
zh_hans: 文件预览
zh_hk: 文件預覽

# 显示当前选择文件的内容预览
source: Display content preview of the currently selected file
zh_hans: 显示当前选择文件的内容预览
zh_hk: 顯示當前選擇文件的內容預覽
